maker114/ESP32-HTTP-Test/src/main.cpp
#include <Arduino.h>
#include <WiFi.h>
#include <U8g2lib.h>
#include <HTTPClient.h>
#include <ArduinoJson.h>
#include <ESP32Time.h>
#include <DallasTemperature.h>
#include <main.h>
#include <EEPROM.h>

String url = "https://restapi.amap.com/v3/weather/weatherInfo";
String url2 = "https://api.bilibili.com/x/report/click/now";
String citys = "420115"; // 江夏区420115
String key = "e2cdd38696d47e8da458493bef49a838";

// 配置OLED屏幕的SPI
U8G2_SH1106_128X64_NONAME_F_4W_HW_SPI u8g2(U8G2_R0, /* cs=*/14, /* dc=*/12, /* reset=*/13); // scl：io18  sda：io23

// 定义JSON解析得到的变量
int temperature = 0;  // 温度
int humidity = 0;     // 湿度
String windpower;     // 风力
String province;      // 省份
String city;          // 城市
String weather;       // 天气
String winddirection; // 风向
String reporttime;    // 时间
int nowtime;          // 北京时间

// 配置RTC时钟
ESP32Time rtc(3600 * 8); // offset in seconds GMT+8

// 初始化变量
int key_num = 0;            // 按键值
float PotValue = 0;         // 电压值
uint16_t Time_count = 0;    // 时间计数
String response, response2; // HTTP响应

// 初始化标志位
int Update_Flag = 0;     // 更新标志位，为了避免在同一时间内反复触发
int Button_Flag = 0;     // 按键标志位，为了避免在按键按下后被视为连按
int mode_flag = 0;       // 模式标志位，为了在多个模式中进行切换
int LastSecond_Flag = 0; // 秒标志位，为了与RTC时间相对应
void setup()
{
  // 初始化IO
  pinMode(17, INPUT_PULLUP); // 控制按键
  pinMode(16, INPUT_PULLUP); // 控制按键
  pinMode(2, OUTPUT);        // 控制LED

  // 初始化OLED
  u8g2.begin();
  u8g2.enableUTF8Print(); // 开启中文字符支持
  PowerOn_Animation();
  // 初始化串口
  // Serial.begin(9600);
  // Serial.println("Hello World!\r\n");

  // 初始化内部EEPROM
  EEPROM.begin(12);

  WIFI_Connect(); // 连接WiFi

  // 初始化HTTP连接，联网以获取JSON文件
  HTTPClient http;                                    // 创建HTTP对象
  http.begin(url + "?city=" + citys + "&key=" + key); // 访问指定URl获取天气信息
  int httpCode1 = http.GET();                         // 接受HTTP相应状态码
  response = http.getString();                        // 获取天气正文
  http.end();                                         // 结束HTTP连接

  http.begin(url2);             // 访问指定URl获取时间信息（感谢阿b的API）
  int httpCode2 = http.GET();   // 接受HTTP相应状态码
  response2 = http.getString(); // 获取时间正文
  http.end();                   // 结束HTTP连接

  if (httpCode1 != 200 || httpCode2 != 200)
  {
    HTTP_LinkError_Handle(); // 联网失败处理函数
  }

  // 解析并转换JSON天气数据
  DynamicJsonDocument doc(1024);  // 初始化DynamicJsonDocument对象
  deserializeJson(doc, response); // 解析JSON数据，获取实时天气
  temperature = doc["lives"][0]["temperature"].as<int>();
  humidity = doc["lives"][0]["humidity"].as<int>();
  windpower = doc["lives"][0]["windpower"].as<String>();
  winddirection = doc["lives"][0]["winddirection"].as<String>();
  province = doc["lives"][0]["province"].as<String>();
  city = doc["lives"][0]["city"].as<String>();
  weather = doc["lives"][0]["weather"].as<String>();
  reporttime = doc["lives"][0]["reporttime"].as<String>();

  // 解析并转换JSON时间数据
  DynamicJsonDocument doc2(1024);          // 初始化DynamicJsonDocument对象
  deserializeJson(doc2, response2);        // 解析JSON数据，获取时间
  nowtime = doc2["data"]["now"].as<int>(); // 赋值

  u8g2.setCursor(5, 60); // U8G2显示连接成功
  u8g2.setFont(u8g2_font_new3x9pixelfont_tf);
  u8g2.printf("Geting Data...");
  u8g2.sendBuffer();

  // 初始化RTC时钟
  rtc.setTime(nowtime);
  WiFi.disconnect(true, false);
  WiFi.mode(WIFI_OFF);

  First_IN_Animation(); // 第一次进入动画
}

void loop()
{
  // OLED帧起始

  weather_update(0); // 天气更新
  Button_Scan();     // 按键扫描

  if (rtc.getSecond() != LastSecond_Flag) // 1s刷新一次
  {
    LastSecond_Flag = rtc.getSecond(); // 更新秒标志位,只刷新一次
    u8g2.clearBuffer();
    switch (mode_flag)
    {
    case 0:
      Display_Mode1();
      break;
    case 1:
      Display_Mode2();
      break;
    case 3:
      Display_Mode4();
      break;
    default:
      break;
    }
  }
  if (rtc.getSecond() % 20 == 0 && mode_flag == 2) // 60s刷新一次
  {
    u8g2.clearBuffer();
    Display_Mode3();
  }
  // 计数装置
  delay(10);
}

enum TIME
{
  H1,
  H2,
  M1,
  M2
};
uint8_t NOW_Time[4] = {0, 0, 0, 0};
uint8_t LAST_Time[4] = {0, 0, 0, 0};
float X_Data_H1 = 0;
float X_Data_H2 = 0;
float X_Data_M1 = 0;
float X_Data_M2 = 0;
void Display_Mode1(void)
{
  /*===========================================*/
  // 模式一，正常时间显示界面
  /*===========================================*/
  // 时间赋值
  NOW_Time[H1] = rtc.getHour() / 10;
  NOW_Time[H2] = rtc.getHour() % 10;
  NOW_Time[M1] = rtc.getMinute() / 10;
  NOW_Time[M2] = rtc.getMinute() % 10;
  // 判断是否需要刷新、
  u8g2.setFont(u8g2_font_logisoso32_tn);

  if (NOW_Time[M2] != LAST_Time[M2])
  {
    X_Data_M2 = 0;
  }
  if (NOW_Time[M1] != LAST_Time[M1])
  {
    X_Data_M1 = 0;
  }
  if (NOW_Time[H2] != LAST_Time[H2])
  {
    X_Data_H2 = 0;
  }
  if (NOW_Time[H1] != LAST_Time[H1])
  {
    X_Data_H1 = 0;
  }
  do
  {
    u8g2.clearBuffer();
    u8g2.setFont(u8g2_font_logisoso32_tn);

    Move_Cursor(32, &X_Data_M2);
    u8g2.setCursor(u8g2.getStrWidth("00:0"), X_Data_M2);
    u8g2.printf("%d", NOW_Time[M2]);
    u8g2.setCursor(u8g2.getStrWidth("00:0"), X_Data_M2 + 33);
    u8g2.printf("%d", LAST_Time[M2]);

    if (X_Data_M2 == 32)
      Move_Cursor(32, &X_Data_M1);
    u8g2.setCursor(u8g2.getStrWidth("00:"), X_Data_M1);
    u8g2.printf("%d", NOW_Time[M1]);
    u8g2.setCursor(u8g2.getStrWidth("00:"), X_Data_M1 + 33);
    u8g2.printf("%d", LAST_Time[M1]);

    if (X_Data_M1 == 32)
      Move_Cursor(32, &X_Data_H2);
    u8g2.setCursor(u8g2.getStrWidth("0"), X_Data_H2);
    u8g2.printf("%d", NOW_Time[H2]);
    u8g2.setCursor(u8g2.getStrWidth("0"), X_Data_H2 + 33);
    u8g2.printf("%d", LAST_Time[H2]);

    if (X_Data_H2 == 32)
      Move_Cursor(32, &X_Data_H1);
    u8g2.setCursor(0, X_Data_H1);
    u8g2.printf("%d", NOW_Time[H1]);
    u8g2.setCursor(0, X_Data_H1 + 33);
    u8g2.printf("%d", LAST_Time[H1]);

    u8g2.setCursor(u8g2.getStrWidth("00"), 32);
    u8g2.printf(":");

    u8g2.setDrawColor(0);
    u8g2.drawBox(0, 33, 128, 33);
    u8g2.setDrawColor(1);

    //  秒
    u8g2.setFont(u8g2_font_logisoso16_tn);
    u8g2.setCursor(100, 16);
    if (rtc.getSecond() < 10)
      u8g2.printf("0%d", rtc.getSecond());
    else
      u8g2.printf("%d", rtc.getSecond());
    // AM/PM
    u8g2.setFont(u8g2_font_profont22_tr);
    u8g2.setCursor(100, 32);
    String nowtime = rtc.getAmPm();
    char *c = (char *)nowtime.c_str();
    u8g2.printf("%s", c);
    u8g2.drawHLine(0, 36, 128);
    u8g2.setFont(u8g2_font_wqy12_t_gb2312);
    u8g2.setCursor(0, 48);
    u8g2.printf("天气： %s %d℃", weather, temperature);
    u8g2.setCursor(0, 62);
    u8g2.printf("风力： %s %s级", winddirection, windpower);
    // 显示天气图标
    u8g2.setCursor(110, 48);
    u8g2.setFontMode(0);
    u8g2.setFont(u8g2_font_open_iconic_weather_2x_t);
    if (weather == "晴" && rtc.getHour(true) > 6 && rtc.getHour(true) <= 17) // 上午7点到下午5点为白天
      u8g2.drawGlyph(105, 58, 0x45);
    else if (weather == "晴" && rtc.getHour(true) > 17 && rtc.getHour(true) <= 6) // 下午6点到第二天6点为晚上
      u8g2.drawGlyph(105, 58, 0x42);
    else if (weather == "阴")
      u8g2.drawGlyph(105, 58, 0x41);
    else if (weather == "多云")
      u8g2.drawGlyph(105, 58, 0x40);
    else if (weather == "小雨" || weather == "中雨" || weather == "大雨" || weather == "暴雨" || weather == "雨" || weather == "阵雨")
      u8g2.drawGlyph(105, 58, 0x43); // 未知的天气将不会显示图标
    u8g2.sendBuffer();
    delay(10);
  } while (X_Data_H1 < 32 || X_Data_H2 < 32 || X_Data_M1 < 32 || X_Data_M2 < 32);
  LAST_Time[H2] = NOW_Time[H2];
  LAST_Time[H1] = NOW_Time[H1];
  LAST_Time[M1] = NOW_Time[M1];
  LAST_Time[M2] = NOW_Time[M2];
}

void Display_Mode2(void)
{
  /*===========================================*/
  // 模式二，详细天气显示界面
  /*===========================================*/
  u8g2.setFont(u8g2_font_wqy12_t_gb2312);
  u8g2.setCursor(0, 12);
  u8g2.printf("天气： %s %d℃", weather, temperature);
  u8g2.setCursor(0, 24);
  u8g2.printf("风力： %s %s级", winddirection, windpower);
  // 显示天气图标
  u8g2.setCursor(110, 25);
  u8g2.setFontMode(0);
  u8g2.setFont(u8g2_font_open_iconic_weather_2x_t);
  if (weather == "晴" && rtc.getHour(true) > 6 && rtc.getHour(true) <= 17) // 上午7点到下午5点为白天
    u8g2.drawGlyph(105, 25, 0x45);
  else if (weather == "晴" && rtc.getHour(true) > 17 && rtc.getHour(true) <= 6) // 下午6点到第二天6点为晚上
    u8g2.drawGlyph(105, 25, 0x42);
  else if (weather == "阴")
    u8g2.drawGlyph(105, 25, 0x41);
  else if (weather == "多云")
    u8g2.drawGlyph(105, 25, 0x40);
  else if (weather == "小雨" || weather == "中雨" || weather == "大雨" || weather == "暴雨" || weather == "雨" || weather == "阵雨")
    u8g2.drawGlyph(105, 25, 0x43);
  // 未知的天气将不会显示图标
  // else
  //   u8g2.drawGlyph(105, 58, 0x40);
  u8g2.setFont(u8g2_font_wqy12_t_gb2312);
  u8g2.setCursor(0, 36);
  float PotValue = analogRead(34) * 0.001705;
  u8g2.printf("电池电量：%.1fV", PotValue);
  u8g2.setCursor(0, 50);
  u8g2.printf("天气更新时间：");
  u8g2.setFont(u8g2_font_6x10_mf);
  u8g2.setCursor(0, 64);
  u8g2.printf("%s", reporttime.c_str());
  u8g2.sendBuffer();
}

float change_H1[8] = {0, 0, 0, 0, 0, 0, 0, 0};
float change_H2[8] = {0, 0, 0, 0, 0, 0, 0, 0};

float change_M1[8] = {0, 0, 0, 0, 0, 0, 0, 0};
float change_M2[8] = {0, 0, 0, 0, 0, 0, 0, 0};

