maker114/ESP32-HTTP-Test/src/main.cpp
float change_S1[8] = {0, 0, 0, 0, 0, 0, 0, 0};
float change_S2[8] = {0, 0, 0, 0, 0, 0, 0, 0};

int num1 = 0;
int num2 = 0;
void Display_Mode3(void)
{
  /*===========================================*/
  // 模式三，简单时钟界面
  /*===========================================*/
  u8g2.clearBuffer(); // 清空缓冲区
  u8g2.setFont(u8g2_font_maniac_tn);
  u8g2.setCursor(30, 42);
  // 小时
  if (rtc.getHour(true) < 10)
    u8g2.printf("0%d", rtc.getHour(true));
  else
    u8g2.printf("%d", rtc.getHour(true));
  // 分隔
  u8g2.printf(":");
  // 分钟
  if (rtc.getMinute() < 10)
    u8g2.printf("0%d", rtc.getMinute());
  else
    u8g2.printf("%d", rtc.getMinute());
  u8g2.sendBuffer(); // 发送缓冲区数据
}

int Refresh_Time = 0;
void Display_Mode4(void)
{
  /*===========================================*/
  // 模式四，带有秒针简单时钟界面
  /*===========================================*/
  int Hour = rtc.getHour(true);
  int Minute = rtc.getMinute();
  int Second = rtc.getSecond();
  do
  {
    u8g2.clearBuffer(); // 清空缓冲区

    NUM_Display(Hour / 10, 14, 20, change_H1, 10, 15);
    NUM_Display(Hour % 10, 14 + 15, 20, change_H2, 10, 15);

    u8g2.drawVLine(46, 25, 5);
    u8g2.drawVLine(46, 40, 5);

    NUM_Display(Minute / 10, 51, 20, change_M1, 10, 15);
    NUM_Display(Minute % 10, 51 + 15, 20, change_M2, 10, 15);

    u8g2.drawVLine(83, 25, 5);
    u8g2.drawVLine(83, 40, 5);

    NUM_Display(Second / 10, 88, 20, change_S1, 10, 15);
    NUM_Display(Second % 10, 88 + 15, 20, change_S2, 10, 15);

    u8g2.sendBuffer(); // 发送缓冲区数据

    delay(15);
    Refresh_Time++;
  } while (Refresh_Time < 15); // 强制刷新15次，避免出现卡顿现象
  Refresh_Time = 0;
}

void Button_Scan(void)
{
  if (digitalRead(17) == LOW && Button_Flag == 0)
  {
    delay(20);
    if (digitalRead(17 == LOW) && Button_Flag == 0)
    {
      u8g2.clearBuffer();
      if (mode_flag == 0)
      {
        mode_flag = 1;
        Display_Mode2();
      }
      else if (mode_flag == 1)
      {
        mode_flag = 2;
        Display_Mode3();
      }
      else if (mode_flag == 2)
      {
        mode_flag = 3;
        Display_Mode4();
      }
      else if (mode_flag == 3)
      {
        mode_flag = 0;
        Display_Mode1();
      }
      Button_Flag = 1; // 标志等于1表示被按下
    }
  }
  if (digitalRead(17) == HIGH && Button_Flag == 1)
  {
    Button_Flag = 0; // 标志等于0表示未被按下
  }
  if (digitalRead(16 == LOW))
  {
    digitalWrite(2, HIGH);
    for (uint8_t i = 0; i < 20; i++)
    {
      if (digitalRead(16) == HIGH)
      {
        // 当提起抬手时退出按键检测
        digitalWrite(2, LOW);
        return;
      }
      delay(50); // 循环20次，约1秒
    }
    digitalWrite(2, LOW);
    weather_update(1); // 长按按键2手动更新天气
  }
}

void HTTP_LinkError_Handle(void)
{
  int Link_Time = 0; // 记录重连次数
  int httpCode1 = 0;
  int httpCode2 = 0;
  do
  {
    // 重新获取连接
    HTTPClient http;                                    // 创建HTTP对象
    http.begin(url + "?city=" + citys + "&key=" + key); // 访问指定URl获取天气信息
    httpCode1 = http.GET();                             // 接受HTTP相应状态码
    response = http.getString();                        // 获取天气正文
    http.end();                                         // 结束HTTP连接

    http.begin(url2);             // 访问指定URl获取时间信息
    httpCode2 = http.GET();       // 接受HTTP相应状态码
    response2 = http.getString(); // 获取时间正文
    http.end();                   // 结束HTTP连接
    Link_Time++;                  // 记录重连次数
    // 重新连接获取UI
    u8g2.clearBuffer();
    u8g2.setFont(u8g2_font_wqy12_t_gb2312); // 设置字体
    u8g2.setCursor(0, 12);
    u8g2.printf("重新获取数据中(%d)", Link_Time);
    u8g2.setCursor(0, 24);
    u8g2.printf("HTTPCode1=%d", httpCode1);
    u8g2.setCursor(0, 36);
    u8g2.printf("HTTPCode2=%d", httpCode2);
    u8g2.sendBuffer();
    delay(100);
  } while (httpCode1 != 200 || httpCode2 != 200);
  u8g2.setCursor(0, 48);
  u8g2.printf("重新获取成功！");
  u8g2.sendBuffer();
  delay(1000);
}

void Move_Cursor(int GoalValue, float *CurrentValue)
{
  float Error = GoalValue - *CurrentValue; // 误差等于目标值减去实际值
  if (fabs(Error) > 1)                     // 误差大于1
  {
    *CurrentValue += Error / 4; // 实际值加上误差除以10
  }
  else
    *CurrentValue = GoalValue; // 误差小于1 直接等于目标值
  // delay(1);
}

void NUM_Display(int num, int x, int y, float change[], int W, int H)
{
  int Goal_Value[7] = {0, 0, 0, 0, 0, 0, 0}; // 目标数组
  switch (num)
  {
  case 0:
    Goal_Value[0] = W;
    Goal_Value[1] = 0;
    Goal_Value[2] = W;
    Goal_Value[3] = H;
    Goal_Value[4] = H;
    Goal_Value[5] = H;
    Goal_Value[6] = H;
    break;

  case 1:
    Goal_Value[0] = 0;
    Goal_Value[1] = 0;
    Goal_Value[2] = 0;
    Goal_Value[3] = 0;
    Goal_Value[4] = H;
    Goal_Value[5] = 0;
    Goal_Value[6] = H;
    break;

  case 2:
    Goal_Value[0] = W;
    Goal_Value[1] = W;
    Goal_Value[2] = W;
    Goal_Value[3] = 0;
    Goal_Value[4] = H;
    Goal_Value[5] = H;
    Goal_Value[6] = 0;
    break;

  case 3:
    Goal_Value[0] = W;
    Goal_Value[1] = W;
    Goal_Value[2] = W;
    Goal_Value[3] = 0;
    Goal_Value[4] = H;
    Goal_Value[5] = 0;
    Goal_Value[6] = H;
    break;

  case 4:
    Goal_Value[0] = 0;
    Goal_Value[1] = W;
    Goal_Value[2] = 0;
    Goal_Value[3] = H;
    Goal_Value[4] = H;
    Goal_Value[5] = 0;
    Goal_Value[6] = H;
    break;

  case 5:
    Goal_Value[0] = W;
    Goal_Value[1] = W;
    Goal_Value[2] = W;
    Goal_Value[3] = H;
    Goal_Value[4] = 0;
    Goal_Value[5] = 0;
    Goal_Value[6] = H;
    break;

  case 6:
    Goal_Value[0] = W;
    Goal_Value[1] = W;
    Goal_Value[2] = W;
    Goal_Value[3] = H;
    Goal_Value[4] = 0;
    Goal_Value[5] = H;
    Goal_Value[6] = H;
    break;

  case 7:
    Goal_Value[0] = W;
    Goal_Value[1] = 0;
    Goal_Value[2] = 0;
    Goal_Value[3] = 0;
    Goal_Value[4] = H;
    Goal_Value[5] = 0;
    Goal_Value[6] = H;
    break;

  case 8:
    Goal_Value[0] = W;
    Goal_Value[1] = W;
    Goal_Value[2] = W;
    Goal_Value[3] = H;
    Goal_Value[4] = H;
    Goal_Value[5] = H;
    Goal_Value[6] = H;
    break;

  case 9:
    Goal_Value[0] = W;
    Goal_Value[1] = W;
    Goal_Value[2] = W;
    Goal_Value[3] = H;
    Goal_Value[4] = H;
    Goal_Value[5] = 0;
    Goal_Value[6] = H;
    break;

  default:
    break;
  }

  Move_Cursor(Goal_Value[0], &change[0]);
  Move_Cursor(Goal_Value[1], &change[1]);
  Move_Cursor(Goal_Value[2], &change[2]);
  Move_Cursor(Goal_Value[3], &change[3]);
  Move_Cursor(Goal_Value[4], &change[4]);
  Move_Cursor(Goal_Value[5], &change[5]);
  Move_Cursor(Goal_Value[6], &change[6]);

  Move_Cursor(H, &change[7]); // 计数用

  u8g2.drawHLine(x + 1, y, change[0]);             // 上横线
  u8g2.drawHLine(x + 1, y + H, change[1]);         // 中横线
  u8g2.drawHLine(x + 1, y + 2 * H - 1, change[2]); // 下横线

  u8g2.drawVLine(x + 1, y, change[3]);     // 左上竖线
  u8g2.drawVLine(x + W, y, change[4]);     // 右上竖线
  u8g2.drawVLine(x + 1, y + H, change[5]); // 左下竖线
  u8g2.drawVLine(x + W, y + H, change[6]); // 右下竖线
}

/**
 * @brief WiFi连接程序
 * @note code含义
 *      WL_NO_SHIELD        = 255,    // 用于兼容WIFI屏蔽库
 *      WL_IDLE_STATUS      = 0       //空闲状态
 *      WL_NO_SSID_AVAIL    = 1       //未找到指定SSID
 *      WL_SCAN_COMPLETED   = 2       //扫描完成
 *      WL_CONNECTED        = 3       //连接成功
 *      WL_CONNECT_FAILED   = 4       //连接失败
 *      WL_CONNECTION_LOST  = 5       //连接丢失
 *      WL_DISCONNECTED     = 6       //未连接
 */
// 声明结构体
struct WIFI_Data
{
  const char *ssid; // 在出错时显示未定义
  const char *password;
};
// 利用结构体来存储WiFi信息
#define WIFI_NUM 3 // WiFi数量
struct WIFI_Data MY_WIFI[WIFI_NUM] =
    {
        {"TP-LINK_6B14", "423.family.we.are"},
        {"203", "203203203"},
        {"sun", "00000000"}};

