maker114/ESP32-HTTP-Test/src/main.cpp
int Save_ID = 0;
void WIFI_Connect(void)
{
  int WIFI_Connect_Time = 0; // 记录WiFi连接次数
  int WIFI_Connect_ID = 0;   // 记录WiFi连接对象的ID
  float y_Data = 32;
  Save_ID = EEPROM.read(5);
  if (Save_ID < WIFI_NUM && Save_ID >= 0) // 判断EEPROM合法性
  {
    WIFI_Connect_ID = Save_ID;
  }
  do
  {
    u8g2.clearBuffer();
    u8g2.drawLine(5, y_Data + 15, 5, y_Data - 15);
    u8g2.setFont(u8g2_font_10x20_t_arabic);
    u8g2.setCursor(5 + 5, y_Data - 15 + 15);
    u8g2.printf("ESP32 CLOCK");
    u8g2.setFont(u8g2_font_profont12_mf);
    u8g2.setCursor(5 + 6, y_Data + 13);
    u8g2.printf("Design by Maker114");
    Move_Cursor(20, &y_Data);
    u8g2.sendBuffer();
    delay(15);
  } while (y_Data > 20);

  while (1)
  {
    // 初始化WIFI
    WiFi.begin(MY_WIFI[WIFI_Connect_ID].ssid, MY_WIFI[WIFI_Connect_ID].password);
    for (uint8_t i = 0; i <= 4; i++)
    {
      // 显示连接UI
      u8g2.clearBuffer();
      u8g2.drawLine(5, y_Data + 15, 5, y_Data - 15);
      u8g2.setFont(u8g2_font_10x20_t_arabic);
      u8g2.setCursor(5 + 5, y_Data - 15 + 15);
      u8g2.printf("ESP32 CLOCK");
      u8g2.setFont(u8g2_font_profont12_mf);
      u8g2.setCursor(5 + 6, y_Data + 13);
      u8g2.printf("Design by Maker114");

      if (WiFi.status() != WL_CONNECTED)
      {
        digitalWrite(2, HIGH);
        delay(150);
        digitalWrite(2, LOW); // 闪烁表示正在连接
        delay(150);
        u8g2.setCursor(5, 60);
        u8g2.setFont(u8g2_font_new3x9pixelfont_tf);
        u8g2.printf("Searching WIFI...");
        u8g2.sendBuffer();
      }
      else
      {
        digitalWrite(2, LOW);  // 熄灭表示连接成功
        u8g2.setCursor(5, 60); // U8G2显示连接成功
        u8g2.setFont(u8g2_font_new3x9pixelfont_tf);
        u8g2.printf("Geting Data...");
        u8g2.sendBuffer();
        EEPROM.write(5, WIFI_Connect_ID); // 将WiFi连接ID写入EEPROM
        EEPROM.commit();                  // 提交EEPROM写入
        return;                           // 连接成功后跳出函数
      }
    }
    // 连续5次连接失败则切换WiFi
    WIFI_Connect_ID++; // 切换WiFi
    if (WIFI_Connect_ID >= WIFI_NUM)
      WIFI_Connect_ID = 0; // 当遍历完了全部ID后从0开始
  }
}

/**
 * @brief 联网以更新天气数据
 */
#define Interval 30 // 更新间隔（min）
void weather_update(uint8_t mode_flag)
{
  int Link_Time = 0; // 连接次数
  if ((rtc.getMinute() % Interval == 0 && Update_Flag == 0) || mode_flag == 1)
  {
    // 将之前的天气信息更新为“过时的”
    temperature = 0;
    humidity = 0;
    windpower = "Dated";
    winddirection = "Dated";
    province = "Dated";
    city = "Dated";
    weather = "Dated";
    reporttime = "Dated";
    // 如果是模式3与4则不需要更新天气，直接返回
    if (mode_flag == 2 || mode_flag == 3)
      return;
    // 重新连接WIFI
    Save_ID = EEPROM.read(5);
    WiFi.begin(MY_WIFI[Save_ID].ssid, MY_WIFI[Save_ID].password);
    // 开始尝试连接WIFI
    while (WiFi.status() != WL_CONNECTED)
    {
      digitalWrite(2, HIGH);
      delay(500);
      digitalWrite(2, LOW); // 闪烁表示正在连接
      delay(500);
      // 当长时间未能连接上WiFi时，自动停止更新并切换到更加省电的模式4
      if (Link_Time >= 10)
      {
        mode_flag = 3;
        Update_Flag = 1;
        Link_Time = 0;
        Display_Mode4();
        // 关闭WIFI省电
        WiFi.disconnect(true, false);
        WiFi.mode(WIFI_OFF);
        return;
      }
      Link_Time++;
    }
    digitalWrite(2, LOW); // 熄灭表示连接成功
    // UI显示
    u8g2.clearDisplay();
    u8g2.setFont(u8g2_font_wqy12_t_gb2312);
    u8g2.setCursor(0, 12);
    u8g2.printf("更新中...");
    u8g2.sendBuffer();

    // 创建HTTP对象
    HTTPClient http;
    http.begin(url + "?city=" + "420115" + "&key=" + key); // 访问指定URL
    int httpCode = http.GET();                             // 接受HTTP相应状态码
    String response = http.getString();                    // 获得相应正文
    http.end();                                            // 关闭链接

    // 关闭WIFI省电
    WiFi.disconnect(true, false);
    WiFi.mode(WIFI_OFF);

    // UI显示
    u8g2.setCursor(0, 24);
    u8g2.printf("HTTP:%d", httpCode);
    u8g2.sendBuffer();

    // 转换JSON数据并更新
    DynamicJsonDocument doc(1024);  // 初始化DynamicJsonDocument对象
    deserializeJson(doc, response); // 解析JSON数据
    temperature = doc["lives"][0]["temperature"].as<int>();
    humidity = doc["lives"][0]["humidity"].as<int>();
    windpower = doc["lives"][0]["windpower"].as<String>();
    winddirection = doc["lives"][0]["winddirection"].as<String>();
    province = doc["lives"][0]["province"].as<String>();
    city = doc["lives"][0]["city"].as<String>();
    weather = doc["lives"][0]["weather"].as<String>();
    reporttime = doc["lives"][0]["reporttime"].as<String>();

    // UI显示
    u8g2.setCursor(0, 40);
    u8g2.printf("更新成功！");
    u8g2.setFont(u8g2_font_6x10_mf);
    u8g2.setCursor(0, 64);
    u8g2.printf("%s", reporttime.c_str());
    u8g2.sendBuffer();
    delay(2000);
    u8g2.clearBuffer(); // 清除缓冲区避免残留影响主函数显示
    Update_Flag = 1;
  }
  if (rtc.getMinute() % Interval != 0 && Update_Flag == 1)
    Update_Flag = 0; // 避免反复触发
}

void PowerOn_Animation(void)
{
  int Refresh_Time = 0;
  float y_data = 0;
  float x_data = 64;
  // 画线
  do
  {

    u8g2.clearBuffer();
    u8g2.drawLine(64, 32, 64, 32 + y_data);
    u8g2.drawLine(64, 32, 64, 32 - y_data);
    Move_Cursor(15, &y_data);
    u8g2.sendBuffer();
    delay(20);
  } while (y_data < 15);
  delay(200);
  // 显示文字
  do
  {
    u8g2.clearBuffer();
    u8g2.setClipWindow(x_data - 1, 32 - 15, 128 - x_data + 1, 32 + 15);
    u8g2.drawLine(x_data, 32 + 15, x_data, 32 - 15);
    u8g2.setFont(u8g2_font_10x20_t_arabic);
    u8g2.setCursor(x_data + 5, 32 - 15 + 15);
    u8g2.printf("ESP32 CLOCK");
    u8g2.setFont(u8g2_font_profont12_mf);
    u8g2.setCursor(x_data + 6, 32 + 13);
    u8g2.printf("Design by Maker114");
    Move_Cursor(5, &x_data);
    u8g2.sendBuffer();
    delay(20);
  } while (x_data > 5);
  u8g2.setMaxClipWindow();
  delay(200);
}

void First_IN_Animation(void)
{
  float x_data1 = 5;
  float x_data2 = 5;
  float y_data1 = 5;
  float y_data2 = 35;
  float y_data3 = 20;
  float y_data4 = 33;
  do
  {
    u8g2.clearBuffer();
    Move_Cursor(128, &x_data1);
    Move_Cursor(36, &y_data1);
    Move_Cursor(0, &x_data2);
    Move_Cursor(36, &y_data2);

    Move_Cursor(0, &y_data3);
    Move_Cursor(0, &y_data4);

    u8g2.setFont(u8g2_font_10x20_t_arabic);
    u8g2.setCursor(5 + 5, y_data3);
    u8g2.printf("ESP32 CLOCK");
    u8g2.setFont(u8g2_font_profont12_mf);
    u8g2.setCursor(5 + 6, y_data4);
    u8g2.printf("Design by Maker114");

    u8g2.setDrawColor(0);
    u8g2.drawBox(0, 0, 128, 2);
    u8g2.setDrawColor(1);

    u8g2.drawLine(x_data1, y_data1, x_data2, y_data2);
    u8g2.sendBuffer();
    delay(15);
  } while (x_data1 < 128 || y_data1 < 36 || x_data2 > 0 || y_data2 < 36 || y_data3 > 0 || y_data4 > 0);

  float x_data3 = 128;
  do
  {
    Move_Cursor(0, &x_data3);
    u8g2.clearBuffer();
    u8g2.setFont(u8g2_font_logisoso32_tn);
    u8g2.setCursor(x_data3, 33);
    u8g2.printf("00:00");
    u8g2.setFont(u8g2_font_logisoso16_tn);
    u8g2.setCursor(x_data3 + 100, 16);
    if (rtc.getSecond() < 10)
      u8g2.printf("0%d", rtc.getSecond());
    else
      u8g2.printf("%d", rtc.getSecond());

    u8g2.setFont(u8g2_font_profont22_tr);
    u8g2.setCursor(x_data3 + 100, 32);
    String nowtime = rtc.getAmPm();
    char *c = (char *)nowtime.c_str();
    u8g2.printf("%s", c);

    u8g2.drawHLine(0, 36, 128);

    u8g2.setFont(u8g2_font_wqy12_t_gb2312);
    u8g2.setCursor(x_data3 + 0, 48);
    u8g2.printf("天气： %s %d℃", weather, temperature);
    u8g2.setCursor(x_data3 + 0, 62);
    u8g2.printf("风力： %s %s级", winddirection, windpower);
    u8g2.setCursor(x_data3 + 110, 48);
    u8g2.setFontMode(0);
    u8g2.setFont(u8g2_font_open_iconic_weather_2x_t);
    if (weather == "晴" && rtc.getHour(true) > 6 && rtc.getHour(true) <= 17) // 上午7点到下午5点为白天
      u8g2.drawGlyph(x_data3 + 105, 58, 0x45);
    else if (weather == "晴" && rtc.getHour(true) > 17 && rtc.getHour(true) <= 6) // 下午6点到第二天6点为晚上
      u8g2.drawGlyph(x_data3 + 105, 58, 0x42);
    else if (weather == "阴")
      u8g2.drawGlyph(x_data3 + 105, 58, 0x41);
    else if (weather == "多云")
      u8g2.drawGlyph(x_data3 + 105, 58, 0x40);
    else if (weather == "小雨" || weather == "中雨" || weather == "大雨" || weather == "暴雨" || weather == "雨" || weather == "阵雨")
      u8g2.drawGlyph(x_data3 + 105, 58, 0x43); // 未知的天气将不会显示图标

    u8g2.sendBuffer();
    delay(20);
  } while (x_data3 > 0);
}